cases/aeration/CaseB_Central/0/T.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField   uniform 285.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 285.15;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.water;
        inletValue      uniform 285.15;
        value           uniform 285.15;
    }

    sideWalls
    {
        type            zeroGradient;
    }

    floor
    {
        type            zeroGradient;
    }

    atmosphere
	{
		type            zeroGradient;
	}

    diffusers
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
