cases/aeration/CaseB_Central/0/alpha.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 0;
        value           uniform 0;
    }

    sideWalls
    {
        type            zeroGradient;
    }

    floor
    {
        type            zeroGradient;
    }

	atmosphere
	{
		type            inletOutlet;
		phi             phi.air;
		inletValue      uniform 1;
		value           uniform 1;
	}

    diffusers
    {
        type            fixedValue;
        value           uniform 1;
    }
}

// ************************************************************************* //
