cases/aeration/CaseB_Central/0/epsilon.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-4;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.water;
        inletValue      uniform 1e-4;
        value           uniform 1e-4;
    }

    sideWalls
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }

    floor
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }

    atmosphere
	{
		type            zeroGradient;
	}

    diffusers
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }
}

// ************************************************************************* //
