cases/aeration/CaseB_Central/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    outlet
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    sideWalls
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    floor
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    atmosphere
    {
        type            prghPressure;
        p               uniform 1e5;
        value           uniform 1e5;
    }

    diffusers
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
}

// ************************************************************************* //