cases/aeration/CaseB_Central/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    // Bottom
    (0      0      0)       // 0
    (40     0      0)       // 1
    (40     5      0)       // 2
    (0      5      0)       // 3

    // Top
    (0      0      5.13)    // 4
    (40     0      5.13)    // 5
    (40     5      5.13)    // 6
    (0      5      5.13)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (160 64 46)

    simpleGrading
    (
        // x-direction: uniform 0.25 m cells
        1

        // y-direction: targeted refinement across diffuser strips
        (
            (0.10  0.09375  1)    // 0.00 - 0.50 m : 6 cells
            (0.05  0.06250  1)    // 0.50 - 0.75 m : 4 cells, diffuser
            (0.20  0.18750  1)    // 0.75 - 1.75 m : 12 cells
            (0.05  0.06250  1)    // 1.75 - 2.00 m : 4 cells, diffuser
            (0.20  0.18750  1)    // 2.00 - 3.00 m : 12 cells
            (0.05  0.06250  1)    // 3.00 - 3.25 m : 4 cells, diffuser
            (0.20  0.18750  1)    // 3.25 - 4.25 m : 12 cells
            (0.05  0.06250  1)    // 4.25 - 4.50 m : 4 cells, diffuser
            (0.10  0.09375  1)    // 4.50 - 5.00 m : 6 cells
        )

        // z-direction: refinement over first 0.50 m above floor
        (
            (0.0974659  0.1739130  1)   // 0.00 - 0.50 m : 8 cells
            (0.7797271  0.6956522  1)   // 0.50 - 4.50 m : 32 cells
            (0.1228070  0.1304348  1)   // 4.50 - 5.13 m : 6 cells
        )
    )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    sideWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }

    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //