cases/aeration/CaseB_Central/system/blockMeshDict.geometryCheck
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    // Bottom
    (0      0      0)       // 0
    (40     0      0)       // 1
    (40     5      0)       // 2
    (0      5      0)       // 3

    // Top
    (0      0      5.13)    // 4
    (40     0      5.13)    // 5
    (40     5      5.13)    // 6
    (0      5      5.13)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (160 40 40)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    sideWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }

    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //