cases/aeration/CaseB_Central/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     aerationDOFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   15;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

writeAtEnd      true;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.1;

maxDeltaT       0.01;

functions
{
    fieldAverage
    {
        type            fieldAverage;
        libs            ( fieldFunctionObjects );
        enabled         true;
        timeStart       180;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        restartOnRestart false;
        restartOnOutput false;
        fields          ( U.water { mean on ; prime2Mean off ; base time ; } U.air { mean on ; prime2Mean off ; base time ; } alpha.air { mean on ; prime2Mean off ; base time ; } p { mean on ; prime2Mean off ; base time ; } k.water { mean on ; prime2Mean off ; base time ; } );
    }
}


// ************************************************************************* //
