cases/aeration/CaseB_Central/system/oxygenTransferMeanDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      oxygenTransferMeanDict;
}

functions
{
    loadOTC
    {
        type            readFields;
        libs            (fieldFunctionObjects);

        fields
        (
            oxygenTransferCoeffPost
        );
    }

    oxygenTransferMean
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);

        fields
        (
            oxygenTransferCoeffPost
            {
                mean            yes;
                prime2Mean      no;
                base            iteration;
            }
        );
    }
}
